### Groupby

Groupby allows you to group together rows based off of a column and perform an aggregate function on them like in SQL eg sum, product, standard deviation, mean etc. 

<img src="files/group.png">

In [1]:
import numpy as np 
import pandas as pd

In [2]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'person':['Foo','Bar','John','Doe','Tom','Jerry'],
        'Sales':[200,123,345,234,124,256]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Company person  Sales
0    GOOG    Foo    200
1    GOOG    Bar    123
2    MSFT   John    345
3    MSFT    Doe    234
4      FB    Tom    124
5      FB  Jerry    256

In [6]:
# Grouping by company 
df.groupby('Company') # If I run like this I'll just get an Obj of where it's stored in memory

In [7]:
# Store in in a variable 
byComp = df.groupby('Company')

In [9]:
# Calling the variable by an aggregate fn eg mean
# Will work with only Floats and Ints. Strings will be ignored
byComp.mean()

         Sales
Company
FB       190.0
GOOG     161.5
MSFT     289.5

In [10]:
# Sum
byComp.sum()

         Sales
Company
FB         380
GOOG       323
MSFT       579

In [11]:
# Standars Deviation 
byComp.std()

             Sales
Company
FB       93.338095
GOOG     54.447222
MSFT     78.488853

In [12]:
# Narrow down by a single company eg FB
byComp.sum().loc['FB']

Sales    380
Name: FB, dtype: int64

In [14]:
# Checking number of instances per col 
# Per company we have 2 people with 2 sales each
df.groupby('Company').count()

         person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [16]:
# Max and Min for each company
df.groupby('Company').max()

        person  Sales
Company
FB         Tom    256
GOOG       Foo    200
MSFT      John    345

In [17]:
df.groupby('Company').min()

        person  Sales
Company
FB       Jerry    124
GOOG       Bar    123
MSFT       Doe    234

In [20]:
# Using the describe method which will give you a bunch of info
df.groupby('Company').describe()

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
FB        2.0  190.0  93.338095  124.0  157.00  190.0  223.00  256.0
GOOG      2.0  161.5  54.447222  123.0  142.25  161.5  180.75  200.0
MSFT      2.0  289.5  78.488853  234.0  261.75  289.5  317.25  345.0

In [24]:
# If you don't like the output above you can append 'transpose'
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   190.000000  161.500000  289.500000
      std     93.338095   54.447222   78.488853
      min    124.000000  123.000000  234.000000
      25%    157.000000  142.250000  261.750000
      50%    190.000000  161.500000  289.500000
      75%    223.000000  180.750000  317.250000
      max    256.000000  200.000000  345.000000